config-breakdown.org
#+TITLE:A Breakdown of My Emacs Configuration
#+AUTHOR: Jon Pielaet
#+OPTIONS: date:nil
#+LATEX_HEADER: \usepackage[margin=0.3in]{geometry}
#+BEGIN_CENTER
	
/This is an example of a GNU Emacs configuration for use/ /with the Emacspeak text-to-speech system./
/Emacspeak is a software package that extends GNU Emacs (Emacs)/
/with powerful text-to-speech capabilities and enables people/
/with limited or no vision to use Emacs./
/Although Emacs is a text editor, it can also be programmed/ 
/to do many other tasks. As shown by this configuration,/

/Emacs can be used for just about anything./
/From staying organized with todo lists, to reading news, chatting online,/
/controling media players, or using multiple terminal emulators,/
/you can do all of it with Emacs./
   
/This configuration  has been customized for use with many/
/programming languages and applications./

/The initialization (init) of Emacs has been divided into/
/different files based on the data structures of the/
/Emacs Lisp language. (elisp) Each configuration file is included/
/below and can be used as a working example of how to use elisp/
/to customize Emacs./
#+END_CENTER

* Background 
In 2015, I started diving deeper into [[https://www.gnu.org/software/emacs/][GNU Emacs]] because I saw its
potential as an [[https://www.atia.org/at-resources/what-is-at/][assistive technology]]
Not only as a way of providing better access to books
and code for my students and clients, many of whom are blind, but also as a
tool for creating more accessible content. [[https://www.regular-expressions.info/][Regular expressions]] and modes
like [[https://orgmode.org/][Org]], [[https://jblevins.org/projects/markdown-mode/][Markdown]], and [[https://www.gnu.org/software/auctex/][AucTex]] are extremely useful in the 
production of [[https://www.queensu.ca/accessibility/how-info/what-are-alternate-formats][alternate formats]].

Although I had used Emacs as a vanilla text editor off and on since the
1990's, I didn't learn anything about the underlying Emacs Lisp (elisp) 
programming language until the end of 2015, when I got a hardcopy Emacs 
manual, quit my day job, and grew the requisite "LISP" beard.
Although the learning curve is very high, Emacs rewards the user with an almost unlimited amount of customization.
This means that if you don't like how something works, you can change it yourself. It's this extensibility that gives Emacs and Emacspeak their seamingly magical powers.

* Building Emacs and Emacspeak

Before you are able to make use of the elisp in this configuration you will need to have Emacs
and [[http://emacspeak.sourceforge.net/][Emacspeak]] installed.
I like to use the latest versions of both so I build from the source code.

** Required Disk Space

You should have about **two gigabytes** of storage free to be able to build the source code and run the configuration.
Although the final installed footprint is a much smaller, **300 megabytes** nominally, the development libraries and build depenencies create bulk. These can of course be remove once the installation is complete, if they are no longer needed. This can greatly conserve disk space.

** Compiling Emacs with Emacspeak on 64-bit Ubuntu

/(This example is for 64-bit Ubuntu but it may work on other [[https://distrowatch.com/search.php?basedon=Debian][Debian-based GNU/Linux distrobutions.]])/


=1. Make source code repositories available to apt by uncommenting=

#+BEGIN_SRC bash :tangle yes
sudo sed -i 's/# deb-src/deb-src/g' /etc/apt/sources.list
#+END_SRC

=2. Update sources list=
#+BEGIN_SRC bash :tangle yes
sudo apt update
#+END_SRC

=3. Upgrade any packages that are out-of-date=
#+BEGIN_SRC bash :tangle yes
sudo apt upgrade -y
#+END_SRC

=4. Install some dependencies=
#+BEGIN_SRC bash :tangle yes
sudo apt install git tclx8.4-dev -y && sudo apt-get build-dep emacs25 emacspeak -y
#+END_SRC
=5. Fetch GNU Emacs source code with git=
#+BEGIN_SRC bash :tangle yes
git clone -b master https://git.savannah.gnu.org/git/emacs.git ~/
#+END_SRC
=6. Fetch Emacspeak source code with git=
#+BEGIN_SRC bash :tangle yes
git clone https://github.com/tvraman/emacspeak ~/
#+END_SRC

=7. Build and install GNU Emacs=
#+BEGIN_SRC bash :tangle yes
cd ~/emacs
./autogen.sh && ./configure --with-imagemagick && make && sudo make install
#+END_SRC
=8. Build Emacspeak and install=
#+BEGIN_SRC bash :tangle yes
cd ~/emacspeak 
make && sudo make install
#+END_SRC

=9. Build optional speech server (I use IBM ViaVoice Outloud which gets installed before this)=
#+BEGIN_SRC bash :tangle yes
cd ~/emacspeak
make outloud && sudo make install
#+END_SRC

=10. Add an environment variable to your shell config file for the speech synthesizer you want to use.=

=(change espeak to outloud if you want to use outloud!)=

#+BEGIN_SRC bash :tangle yes
sed -e "\$aexport DTK_PROGRAM" ~/.bashrc

sed -e "\$aDTK_PROGRAM=espeak" ~/.bashrc
#+END_SRC

=11. Source the config file so the shell recognizes the changes=
=(or logout and login again)=
#+BEGIN_SRC bash :tangle yes
source ~/.bashrc
#+END_SRC


* Clone My Configuration Repository
Cloning a copy of the repository will make it easy to use the configuration without needing to make all the files from scratch.

#+BEGIN_SRC bash :tangle yes
git clone https://github.com/leavesofgrass/elisp ~/
#+END_SRC

* Installing the Emacs Lisp Packages
The very first time you run Emacs, you will want to tell the software
to download some packages before you can use the configuration.
I suggest installing the rest of the packages before you use Emacs too.
