config-breakdown.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-19 Sun 17:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Breakdown of My Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jon Pielaet" />
</head>
<body>
<div id="content">
<h1 class="title">A Breakdown of My Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ada876">1. Background</a></li>
<li><a href="#orgc07101d">2. Building Emacs and Emacspeak</a>
<ul>
<li><a href="#org80486db">2.1. Required Disk Space</a></li>
<li><a href="#orgedd0679">2.2. Compiling Emacs with Emacspeak on 64-bit Ubuntu</a></li>
</ul>
</li>
<li><a href="#org1fbb836">3. Clone My Configuration Repository</a></li>
<li><a href="#orge678aa2">4. Installing the Emacs Lisp Packages</a>
<ul>
<li><a href="#org47b714a">4.1. Installing the Package Manager</a></li>
<li><a href="#org29a3459">4.2. Installing the Remaining Packages</a></li>
</ul>
</li>
<li><a href="#org37dbb61">5. early-init.el</a></li>
<li><a href="#orgce5d27f">6. .emacs</a>
<ul>
<li><a href="#orgf6586f7">6.1. package-repo.el</a></li>
<li><a href="#org15b7449">6.2. load-theme.el</a></li>
<li><a href="#org86db0a0">6.3. custom.el</a></li>
<li><a href="#orga894958">6.4. defs.el</a></li>
<li><a href="#orgb065608">6.5. func.el</a></li>
<li><a href="#orgf30c1c5">6.6. auto-mode-alist.el</a></li>
<li><a href="#orgdf46ad8">6.7. hooks.el</a></li>
<li><a href="#orgcc6bf56">6.8. keybindings.el</a></li>
<li><a href="#org9c8c74c">6.9. modes.el</a></li>
<li><a href="#org716550d">6.10. init-packages.el</a></li>
<li><a href="#org5ec2046">6.11. ensure-packages.el</a></li>
</ul>
</li>
<li><a href="#org84afac8">7. A Thank You</a></li>
<li><a href="#orgdafe371">8. License</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
	
<i>This is an example of a GNU Emacs configuration for use</i> <i>with the Emacspeak text-to-speech system.</i>
<i>Emacspeak is a software package that extends GNU Emacs (Emacs)</i>
<i>with powerful text-to-speech capabilities and enables people</i>
<i>with limited or no vision to use Emacs.</i>
<i>Although Emacs is a text editor, it can also be programmed</i> 
<i>to do many other tasks. As shown by this configuration,</i>
</p>

<p>
<i>Emacs can be used for just about anything.</i>
<i>From staying organized with todo lists, to reading news, chatting online,</i>
<i>controling media players, or using multiple terminal emulators,</i>
<i>you can do all of it with Emacs.</i>
</p>

<p>
<i>This configuration  has been customized for use with many</i>
<i>programming languages and applications.</i>
</p>

<p>
<i>The initialization (init) of Emacs has been divided into</i>
<i>different files based on the data structures of the</i>
<i>Emacs Lisp language. (elisp) Each configuration file is included</i>
<i>below and can be used as a working example of how to use elisp</i>
<i>to customize Emacs.</i>
</p>
</div>

<div id="outline-container-org8ada876" class="outline-2">
<h2 id="org8ada876"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
In 2015, I started diving deeper into <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a> because I saw its
potential as an <a href="https://www.atia.org/at-resources/what-is-at/">assistive technology</a>
Not only as a way of providing better access to books
and code for my students and clients, many of whom are blind, but also as a
tool for creating more accessible content. <a href="https://www.regular-expressions.info/">Regular expressions</a> and modes
like <a href="https://orgmode.org/">Org</a>, <a href="https://jblevins.org/projects/markdown-mode/">Markdown</a>, and <a href="https://www.gnu.org/software/auctex/">AucTex</a> are extremely useful in the 
production of <a href="https://www.queensu.ca/accessibility/how-info/what-are-alternate-formats">alternate formats</a>.
</p>

<p>
Although I had used Emacs as a vanilla text editor off and on since the
1990's, I didn't learn anything about the underlying Emacs Lisp (elisp) 
programming language until the end of 2015, when I got a hardcopy Emacs 
manual, quit my day job, and grew the requisite "LISP" beard.
Although the learning curve is very high, Emacs rewards the user with an almost unlimited amount of customization.
This means that if you don't like how something works, you can change it yourself. It's this extensibility that gives Emacs and Emacspeak their seamingly magical powers.
</p>
</div>
</div>

<div id="outline-container-orgc07101d" class="outline-2">
<h2 id="orgc07101d"><span class="section-number-2">2</span> Building Emacs and Emacspeak</h2>
<div class="outline-text-2" id="text-2">
<p>
Before you are able to make use of the elisp in this configuration you will need to have Emacs
and <a href="http://emacspeak.sourceforge.net/">Emacspeak</a> installed.
I like to use the latest versions of both so I build from the source code.
</p>
</div>

<div id="outline-container-org80486db" class="outline-3">
<h3 id="org80486db"><span class="section-number-3">2.1</span> Required Disk Space</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You should have about <b><b>two gigabytes</b></b> of storage free to be able to build the source code and run the configuration.
Although the final installed footprint is a much smaller, <b><b>300 megabytes</b></b> nominally, the development libraries and build depenencies create bulk. These can of course be remove once the installation is complete, if they are no longer needed. This can greatly conserve disk space.
</p>
</div>
</div>

<div id="outline-container-orgedd0679" class="outline-3">
<h3 id="orgedd0679"><span class="section-number-3">2.2</span> Compiling Emacs with Emacspeak on 64-bit Ubuntu</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<i>(This example is for 64-bit Ubuntu but it may work on other <a href="https://distrowatch.com/search.php?basedon=Debian">Debian-based GNU/Linux distrobutions.</a>)</i>
</p>


<p>
<code>1. Make source code repositories available to apt by uncommenting</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo sed -i <span style="color: #7bc275;">'s/# deb-src/deb-src/g'</span> /etc/apt/sources.list
</pre>
</div>

<p>
<code>2. Update sources list</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt update
</pre>
</div>

<p>
<code>3. Upgrade any packages that are out-of-date</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt upgrade -y
</pre>
</div>

<p>
<code>4. Install some dependencies</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt install git tclx8.4-dev -y &amp;&amp; sudo apt-get build-dep emacs25 emacspeak -y
</pre>
</div>
<p>
<code>5. Fetch GNU Emacs source code with git</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone -b master https://git.savannah.gnu.org/git/emacs.git ~/
</pre>
</div>
<p>
<code>6. Fetch Emacspeak source code with git</code>
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/tvraman/emacspeak ~/
</pre>
</div>

<p>
<code>7. Build and install GNU Emacs</code>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #C57BDB;">cd</span> ~/emacs
./autogen.sh &amp;&amp; ./configure --with-imagemagick &amp;&amp; make &amp;&amp; sudo make install
</pre>
</div>
<p>
<code>8. Build Emacspeak and install</code>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #C57BDB;">cd</span> ~/emacspeak 
make &amp;&amp; sudo make install
</pre>
</div>

<p>
<code>9. Build optional speech server (I use IBM ViaVoice Outloud which gets installed before this)</code>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #C57BDB;">cd</span> ~/emacspeak
make outloud &amp;&amp; sudo make install
</pre>
</div>

<p>
<code>10. Add an environment variable to your shell config file for the speech synthesizer you want to use.</code>
</p>

<p>
<code>(change espeak to outloud if you want to use outloud!)</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">sed -e <span style="color: #7bc275;">"\$aexport DTK_PROGRAM"</span> ~/.bashrc

sed -e <span style="color: #7bc275;">"\$aDTK_PROGRAM=espeak"</span> ~/.bashrc
</pre>
</div>

<p>
<code>11. Source the config file so the shell recognizes the changes</code>
<code>(or logout and login again)</code>
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #C57BDB;">source</span> ~/.bashrc
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1fbb836" class="outline-2">
<h2 id="org1fbb836"><span class="section-number-2">3</span> Clone My Configuration Repository</h2>
<div class="outline-text-2" id="text-3">
<p>
Cloning a copy of the repository will make it easy to use the configuration without needing to make all the files from scratch.
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/leavesofgrass/elisp ~/
</pre>
</div>
</div>
</div>

<div id="outline-container-orge678aa2" class="outline-2">
<h2 id="orge678aa2"><span class="section-number-2">4</span> Installing the Emacs Lisp Packages</h2>
<div class="outline-text-2" id="text-4">
<p>
The very first time you run Emacs, you will want to tell the software
to download some packages before you can use the configuration.
I suggest installing the rest of the packages before you use Emacs too.
</p>
</div>
