config-breakdown.org
** Installing the Package Manager
Running the following from the command line will define package repos and install
the paradox package manager.

#+BEGIN_SRC bash 
emacs -Q -batch -l ~/elisp/package-repo.el ~/elisp/init-packages.el
#+END_SRC
** Installing the Remaining Packages
After paradox is installed, running the following will install the rest of the elisp packages asynchronously.

#+BEGIN_SRC bash 
emacs -Q -batch -l ~/elisp/package-repo.el ~/elisp/ensure-packages.el
#+END_SRC

Doing this before trying to use Emacs will help prevent any issues due to missing packages.
* early-init.el
(An elisp file for code to evaluate before any packages start.)

Usually stored in ~/.emacs.d/

#+BEGIN_SRC emacs-lisp :tangle yes
;; remove some bars

(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)

;; no blinking cursor

(blink-cursor-mode 0)

;; no init messages

(setq initial-scratch-message "")
(setq inhibit-startup-message t)

;; use a visual bell

(setq visible-bell t)

;; Shorten Yes/No Dialogs
;; Type Y or N instead of yes or no
;; in the minibuffer

(defalias 'yes-or-no-p 'y-or-n-p)

;; always load the newest byte code

(setq load-prefer-newer t)

;; prefer utf-8 for both display and editing

(prefer-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-default buffer-file-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)
(set-default buffer-file-coding-system 'utf-8-unix)
#+END_SRC

* .emacs
~/.emacs or ~/.emacs.d/init.el

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; This file bootstraps the configuration, which is divided into
  ;; a number of other files.

  ;; Package repositories

  (setq package-repo-file "~/elisp/package-repo.el")
  (load package-repo-file)

  ;; Theme

  (setq load-theme-file "~/elisp/load-theme.el")
  (load load-theme-file)

  ;; Set by customize interface

  (setq custom-file "~/elisp/custom.el")
  (load custom-file)

  ;; Variable definitions 
  (setq defs-file "~/elisp/defs.el")
  (load defs-file)

  ;; Custom functions
  (setq func-file "~/elisp/func.el")
  (load func-file)

  ;; auto-mode-alist
  (setq auto-mode-file "~/elisp/auto-mode-alist.el")
  (load auto-mode-file)

  ;; Hooks
  (setq hooks-file "~/elisp/hooks.el")
  (load hooks-file)

  ;; Keybindings

  (setq keybindings-file "~/elisp/keybindings.el")
  (load keybindings-file)

  (setq modes-file "~/elisp/modes.el")
  (load modes-file)

  ;; Packages

  ;; (setq init-packages-file "~/elisp/init-packages.el")
  ;; (load init-packages-file)

  ;; (setq ensure-packages-file "~/elisp/ensure-packages.el")
  ;; (load ensure-packages-file)
#+END_SRC
** package-repo.el
(An elisp file to define package repository details.)

#+BEGIN_SRC emacs-lisp :tangle yes
;; Packages

(require 'cl)
(require 'package)
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))

  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired

  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)

  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)

  (when (< emacs-major-version 24)

    ;; For important compatibility libraries like cl-lib

    (add-to-list 'package-archives '("gnu" . (concat proto "://elpa.gnu.org/packages/")))))

;; org

(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

(package-initialize)

;; Paradox default interface

;;(paradox-enable)
#+END_SRC
** load-theme.el
(An elisp file to load all the bits of my theme.)

#+BEGIN_SRC emacs-lisp :tangle yes
;; load theme

(load-theme 'doom-vibrant t)
(doom-modeline-mode)

;; theme the visual bell

(doom-themes-visual-bell-config)

;; theme neotree and treemacs

(doom-themes-neotree-config)
(doom-themes-treemacs-config)

;; theme org

(doom-themes-org-config)
#+END_SRC
