config-breakdown.html
<div id="outline-container-org47b714a" class="outline-3">
<h3 id="org47b714a"><span class="section-number-3">4.1</span> Installing the Package Manager</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Running the following from the command line will define package repos and install
the paradox package manager.
</p>

<div class="org-src-container">
<pre class="src src-bash">emacs -Q -batch -l ~/elisp/package-repo.el ~/elisp/init-packages.el
</pre>
</div>
</div>
</div>
<div id="outline-container-org29a3459" class="outline-3">
<h3 id="org29a3459"><span class="section-number-3">4.2</span> Installing the Remaining Packages</h3>
<div class="outline-text-3" id="text-4-2">
<p>
After paradox is installed, running the following will install the rest of the elisp packages asynchronously.
</p>

<div class="org-src-container">
<pre class="src src-bash">emacs -Q -batch -l ~/elisp/package-repo.el ~/elisp/ensure-packages.el
</pre>
</div>

<p>
Doing this before trying to use Emacs will help prevent any issues due to missing packages.
</p>
</div>
</div>
</div>
<div id="outline-container-org37dbb61" class="outline-2">
<h2 id="org37dbb61"><span class="section-number-2">5</span> early-init.el</h2>
<div class="outline-text-2" id="text-5">
<p>
(An elisp file for code to evaluate before any packages start.)
</p>

<p>
Usually stored in ~/.emacs.d/
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">remove some bars</span>

(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">no blinking cursor</span>

(blink-cursor-mode 0)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">no init messages</span>

(<span style="color: #51afef;">setq</span> initial-scratch-message <span style="color: #7bc275;">""</span>)
(<span style="color: #51afef;">setq</span> inhibit-startup-message t)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">use a visual bell</span>

(<span style="color: #51afef;">setq</span> visible-bell t)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Shorten Yes/No Dialogs</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">Type Y or N instead of yes or no</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">in the minibuffer</span>

(<span style="color: #51afef;">defalias</span> '<span style="color: #5cEfFF;">yes-or-no-p</span> 'y-or-n-p)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">always load the newest byte code</span>

(<span style="color: #51afef;">setq</span> load-prefer-newer t)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">prefer utf-8 for both display and editing</span>

(prefer-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-default buffer-file-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)
(set-default buffer-file-coding-system 'utf-8-unix)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce5d27f" class="outline-2">
<h2 id="orgce5d27f"><span class="section-number-2">6</span> .emacs</h2>
<div class="outline-text-2" id="text-6">
<p>
~/.emacs or ~/.emacs.d/init.el
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">This file bootstraps the configuration, which is divided into</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">a number of other files.</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Package repositories</span>

(<span style="color: #51afef;">setq</span> package-repo-file <span style="color: #7bc275;">"~/elisp/package-repo.el"</span>)
(load package-repo-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Theme</span>

(<span style="color: #51afef;">setq</span> load-theme-file <span style="color: #7bc275;">"~/elisp/load-theme.el"</span>)
(load load-theme-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Set by customize interface</span>

(<span style="color: #51afef;">setq</span> custom-file <span style="color: #7bc275;">"~/elisp/custom.el"</span>)
(load custom-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Variable definitions </span>
(<span style="color: #51afef;">setq</span> defs-file <span style="color: #7bc275;">"~/elisp/defs.el"</span>)
(load defs-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Custom functions</span>
(<span style="color: #51afef;">setq</span> func-file <span style="color: #7bc275;">"~/elisp/func.el"</span>)
(load func-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">auto-mode-alist</span>
(<span style="color: #51afef;">setq</span> auto-mode-file <span style="color: #7bc275;">"~/elisp/auto-mode-alist.el"</span>)
(load auto-mode-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Hooks</span>
(<span style="color: #51afef;">setq</span> hooks-file <span style="color: #7bc275;">"~/elisp/hooks.el"</span>)
(load hooks-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Keybindings</span>

(<span style="color: #51afef;">setq</span> keybindings-file <span style="color: #7bc275;">"~/elisp/keybindings.el"</span>)
(load keybindings-file)

(<span style="color: #51afef;">setq</span> modes-file <span style="color: #7bc275;">"~/elisp/modes.el"</span>)
(load modes-file)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Packages</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">(setq init-packages-file "~/elisp/init-packages.el")</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">(load init-packages-file)</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">(setq ensure-packages-file "~/elisp/ensure-packages.el")</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">(load ensure-packages-file)</span>
</pre>
</div>
</div>
<div id="outline-container-orgf6586f7" class="outline-3">
<h3 id="orgf6586f7"><span class="section-number-3">6.1</span> package-repo.el</h3>
<div class="outline-text-3" id="text-6-1">
<p>
(An elisp file to define package repository details.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">Packages</span>

(<span style="color: #51afef;">require</span> '<span style="color: #a991f1;">cl</span>)
(<span style="color: #51afef;">require</span> '<span style="color: #a991f1;">package</span>)
(<span style="color: #51afef;">let*</span> ((no-ssl (<span style="color: #51afef;">and</span> (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (<span style="color: #51afef;">if</span> no-ssl <span style="color: #7bc275;">"http"</span> <span style="color: #7bc275;">"https"</span>)))

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired</span>

  (add-to-list 'package-archives (cons <span style="color: #7bc275;">"melpa"</span> (concat proto <span style="color: #7bc275;">"://melpa.org/packages/"</span>)) t)

  <span style="color: #62686E;">;;</span><span style="color: #62686E;">(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)</span>

  (<span style="color: #51afef;">when</span> (&lt; emacs-major-version 24)

    <span style="color: #62686E;">;; </span><span style="color: #62686E;">For important compatibility libraries like cl-lib</span>

    (add-to-list 'package-archives '(<span style="color: #7bc275;">"gnu"</span> . (concat proto <span style="color: #7bc275;">"://elpa.gnu.org/packages/"</span>)))))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org</span>

(add-to-list 'package-archives '(<span style="color: #7bc275;">"org"</span> . <span style="color: #7bc275;">"https://orgmode.org/elpa/"</span>) t)

(package-initialize)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Paradox default interface</span>

<span style="color: #62686E;">;;</span><span style="color: #62686E;">(paradox-enable)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org15b7449" class="outline-3">
<h3 id="org15b7449"><span class="section-number-3">6.2</span> load-theme.el</h3>
<div class="outline-text-3" id="text-6-2">
<p>
(An elisp file to load all the bits of my theme.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">load theme</span>

(load-theme 'doom-vibrant t)
(doom-modeline-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">theme the visual bell</span>

(doom-themes-visual-bell-config)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">theme neotree and treemacs</span>

(doom-themes-neotree-config)
(doom-themes-treemacs-config)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">theme org</span>

(doom-themes-org-config)
</pre>
</div>
</div>
</div>
