config-breakdown.html
<div id="outline-container-org86db0a0" class="outline-3">
<h3 id="org86db0a0"><span class="section-number-3">6.3</span> custom.el</h3>
<div class="outline-text-3" id="text-6-3">
<p>
(An elisp file for the code generated by the Emacs customize interface.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(custom-set-variables
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">custom-set-variables was added by Custom.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">If you edit it by hand, you could mess it up, so be careful.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">Your init file should contain only one such instance.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">If there is more than one, they won't work right.</span>
 '(cider-auto-mode t)
 '(dectalk-default-speech-rate 440)
 '(dired-sidebar-subtree-line-prefix <span style="color: #7bc275;">"__"</span>)
 '(dired-sidebar-theme 'icons)
 '(dired-sidebar-use-custom-font t)
 '(dired-sidebar-use-magit-integration t)
 '(dired-sidebar-use-term-integration t)
 '(dired-sidebar-width 20)
 '(dtk-speech-rate-base 200)
 '(dtk-speech-rate-step 100)
 '(elfeed-feeds
   '(<span style="color: #7bc275;">"https://www.reddit.com/r/mechanicalheadpens/.rss"</span> 
     <span style="color: #7bc275;">"http://pragmaticemacs.com/feed/"</span> 
     (<span style="color: #7bc275;">"http://emacs.stackexchange.com/feeds"</span> emacs)
     (<span style="color: #7bc275;">"http://pragmaticemacs.com/feed/"</span> emacs)
     (<span style="color: #7bc275;">"http://feeds.feedburner.com/XahsEmacsBlog"</span> emacs)
     (<span style="color: #7bc275;">"http://planet.emacsen.org/atom.xml"</span> emacs)
     (<span style="color: #7bc275;">"http://www.reddit.com/r/emacs/.rss"</span> emacs)
     (<span style="color: #7bc275;">"http://rss.slashdot.org/Slashdot/slashdotMain"</span> daily)
     (<span style="color: #7bc275;">"http://feeds.bbci.co.uk/news/rss.xml"</span> daily)))
 '(emacspeak-speak-maximum-line-length 256)
 '(espeak-default-speech-rate 200)
 '(line-number-mode nil)
 '(minimap-automatically-delete-window t)
 '(minimap-dedicated-window t)
 '(minimap-highlight-line t)
 '(minimap-minimum-width 10 nil nil <span style="color: #7bc275;">"minimap min width"</span>)
 '(minimap-width-fraction 0.03)
 '(minimap-window-location 'right)
 '(outloud-default-speech-rate 100)
 '(package-selected-packages
   '(adafruit-wisdom js3-mode rubocop rubocopfmt json-reformat clojure-mode-extra-font-locking pretty-symbols helm-jira
 helm-open-github helm-get-files emmet-mode all-the-icons-gnus all-the-icons-ivy bind-chord ac-html-angular ac-html-bootstrap 
ac-html-csswatcher tabbar free-keys git-gutter-fringe+ all-the-icons-dired dired-sidebar el-get realgud robe ensime scala-mode 
wanderlust swift-mode indent-guide flycheck-rtags ivy-hydra ox-reveal solaire-mode olivetti md4rd erlang pylint org-brain tide ag 
visual-regexp visual-regexp-steroids slack google-translate cask haskell-mode dumb-jump ob-ipython org-ref ess pdf-tools 
salesforce-utils edn ace-flyspell ace-isearch ace-mc evil-lispy toc-org cider calfw-ical calfw-org direx direx-grep elfeed
elfeed-goodies elfeed-org elfeed-protocol elfeed-web kaleidoscope kaleidoscope-evil-state-flash org org-plus-contrib sauron 
browse-kill-ring ox-epub ox-html5slide ox-pandoc pabbrev adaptive-wrap bash-completion aggressive-indent company-auctex company-dict 
company-inf-ruby company-php company-tern concurrent csv-mode diffview dismal dockerfile-mode dotnet magit-popup gnugo 
flatland-black-theme flatland-theme phoenix-dark-pink-theme wl ac-math ac-js2 ac-ispell ac-inf-ruby ac-html ac-helm org-wunderlist 
auto-complete-auctex auto-complete-c-headers auto-complete-chunk auto-complete-clang borg ace-window gmail2bbdb beacon-mode 
cl-lib-highlight yari yaml-mode volatile-highlights multi-term magithub magit inf-ruby gist expand-region emms clojure-mode chess 
coffee-mode erc-colorize erc-hl-nicks erc-status-sidebar erc-terminal-notifier erc-tweet erc-twitch erc-youtube smartparens 
oer-reveal org-pretty-tags say-what-im-doing speechd-el dropbox org-kindle helm-ack helm-bbdb helm-c-yasnippet helm-cider
helm-cider-history helm-dictionary helm-directory helm-elscreen helm-emmet helm-fuzzy-find helm-gitlab helm-gtags 
helm-helm-commands helm-hoogle helm-ispell helm-mode-manager helm-notmuch helm-orgcard helm-pages helm-pass helm-robe helm-spotify  
helm-spotify-plus helm-wordnet helm-youtube counsel-codesearch digitalocean digitalocean-helm helm-lines nerdtab org-listcruncher 
org-make-toc tfsmacs ahk-mode ivy-yasnippet load-env-vars yasnippet-classic-snippets js2-refactor json-mode keymap-utils 
magit-annex magit-find-file vdiff-magit which-key nhexl-mode nlinum nlinum-hl nlinum-relative nvm oauth oauth2 omnisharp org2jekyll 
org2web pandoc pandoc-mode powerline powerline-evil powershell projectile pydoc pydoc-info sos sx auctex bug-hunter calfw calfw-cal 
calfw-gcal cl-format cl-lib company-emoji dired-toggle dired-toggle-sudo easy-kill ein electric-case electric-operator 
electric-spacing evil evil-avy evil-mc evil-mc-extras flycheck gitconfig gitconfig-mode github-clone github-elpa github-issues github-modern-theme
 github-notifier github-pullrequest github-search github-stars google google-c-style graphene helm-flymake 
history hl-indent hl-sentence ido-at-point mew minimap twittering-mode use-package vdiff virtualenv virtualenvwrapper web-mode k
web-mode-edit-element web-search web-server websocket yasnippet yasnippet-snippets android-mode applescript-mode arduino-mode aria2 
avy bbcode-mode bbdb beacon counsel counsel-tramp helm-backup helm-eww helm-google helm-sheet helm-swoop helm-systemd smex 
ample-regexps helm helm-ag helm-ag-r helm-aws helm-bind-key helm-bm helm-books helm-chrome helm-codesearch helm-commandlinefu 
helm-company helm-dired-history helm-dired-recent-dirs helm-emms helm-firefox helm-flycheck helm-flyspell helm-git helm-git-files 
helm-git-grep helm-github-stars helm-gitignore helm-img helm-lastpass helm-ls-git helm-ls-hg helm-ls-svn helm-make helm-mt 
helm-pydoc helm-smex helm-themes helm-tramp helm-unicode helm-w3m hide-mode-line hl-sexp hl-todo ido-occur ido-yes-or-no ioccur 
jedi lastpass async async-await ample-theme company company-arduino company-c-headers company-irony company-jedi company-lua 
company-math company-shell company-sourcekit company-statistics company-suggest company-try-hard company-web crux undo-tree 
paradox))
 '(paradox-async-display-buffer-function nil)
 '(paradox-automatically-star t)
 '(paradox-execute-asynchronously t)
 '(paradox-github-token <span style="color: #7bc275;">""</span>)
 '(tts-strip-octals nil))

(custom-set-faces
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">custom-set-faces was added by Custom.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">If you edit it by hand, you could mess it up, so be careful.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">Your init file should contain only one such instance.</span>
 <span style="color: #62686E;">;; </span><span style="color: #62686E;">If there is more than one, they won't work right.</span>
 '(minimap-active-region-background ((t (<span style="color: #C57BDB;">:background</span> <span style="color: #7bc275;">"#7bc275"</span>)))))
</pre>
</div>
</div>
</div>
