config-breakdown.org
** defs.el
(An elisp file for variable definitions.)

 #+BEGIN_SRC emacs-lisp :tangle yes
;; email

(setq user-mail-address "jon@pielaet.net")


;; narrow region without comfrimation

(put 'narrow-to-region 'disabled nil)

;; font

(set-frame-font "source code pro 18")

;; paradox

(setq url-http-attempt-keepalives nil)
(setq paradox-execute-asynchronously 't)

;; company

;; set default `company-backends'
(setq company-backends
      '((company-files          ; files & directory
         company-keywords       ; keywords
         company-capf
         company-yasnippet
	 company-ghc
	 company-dict
	 company-shell
	 company-tern
         )
        (company-abbrev company-dabbrev)
        ))

;; hide pesky warnings (the lazy way of suppressing the pop-up debugger on init)
;; Emacspeak frequently has some byte code that isn't happy with the existing site-lisp
;; this will prevent it from being annoying at startup but,
;; it will still show the debugger in emergencies

(setq warning-minimum-level :emergency)

;; git-gutter+

(setq git-gutter-fr+-side 'right-fringe)

(setq git-gutter+-disabled-modes '(asm-mode image-mode hexl-mode))

;; org-mode

(require 'org)

(setq org-log-done t)

;; org-agenda

(setq org-agenda-files (list "~/Dropbox/Documents/Orgzly/agenda.org"
			     "~/Dropbox/Documents/Orgzly/ToDo.org"
			     "~/Dropbox/Documents/Orgzly/gcal.org"
			     "~/Dropbox/Documents/Orgzly/notebook.org"))

;; org-gcal

(setq org-gcal-client-id "xxxxxx.apps.googleusercontent.com"
org-gcal-client-secret ""
org-gcal-file-alist '(("jon@pielaet.net" . "~/Dropbox/Documents/Orgzly/gcal.org")))

;; Syntax highlighting for org export

(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

#+END_SRC
