config-breakdown.html
<div id="outline-container-orga894958" class="outline-3">
<h3 id="orga894958"><span class="section-number-3">6.4</span> defs.el</h3>
<div class="outline-text-3" id="text-6-4">
<p>
(An elisp file for variable definitions.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">email</span>

(<span style="color: #51afef;">setq</span> user-mail-address <span style="color: #7bc275;">"jon@pielaet.net"</span>)


<span style="color: #62686E;">;; </span><span style="color: #62686E;">narrow region without comfrimation</span>

(put 'narrow-to-region 'disabled nil)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">font</span>

(set-frame-font <span style="color: #7bc275;">"source code pro 18"</span>)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">paradox</span>

(<span style="color: #51afef;">setq</span> url-http-attempt-keepalives nil)
(<span style="color: #51afef;">setq</span> paradox-execute-asynchronously 't)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">company</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">set default `</span><span style="color: #a991f1;">company-backends</span><span style="color: #62686E;">'</span>
(<span style="color: #51afef;">setq</span> company-backends
      '((company-files          <span style="color: #62686E;">; </span><span style="color: #62686E;">files &amp; directory</span>
         company-keywords       <span style="color: #62686E;">; </span><span style="color: #62686E;">keywords</span>
         company-capf
         company-yasnippet
         company-ghc
         company-dict
         company-shell
         company-tern
         )
        (company-abbrev company-dabbrev)
        ))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">hide pesky warnings (the lazy way of suppressing the pop-up debugger on init)</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">Emacspeak frequently has some byte code that isn't happy with the existing site-lisp</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">this will prevent it from being annoying at startup but,</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">it will still show the debugger in emergencies</span>

(<span style="color: #51afef;">setq</span> warning-minimum-level <span style="color: #C57BDB;">:emergency</span>)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">git-gutter+</span>

(<span style="color: #51afef;">setq</span> git-gutter-fr+-side 'right-fringe)

(<span style="color: #51afef;">setq</span> git-gutter+-disabled-modes '(asm-mode image-mode hexl-mode))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org-mode</span>

(<span style="color: #51afef;">require</span> '<span style="color: #a991f1;">org</span>)

(<span style="color: #51afef;">setq</span> org-log-done t)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org-agenda</span>

(<span style="color: #51afef;">setq</span> org-agenda-files (list <span style="color: #7bc275;">"~/Dropbox/Documents/Orgzly/agenda.org"</span>
                             <span style="color: #7bc275;">"~/Dropbox/Documents/Orgzly/ToDo.org"</span>
                             <span style="color: #7bc275;">"~/Dropbox/Documents/Orgzly/gcal.org"</span>
                             <span style="color: #7bc275;">"~/Dropbox/Documents/Orgzly/notebook.org"</span>))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org-gcal</span>

(<span style="color: #51afef;">setq</span> org-gcal-client-id <span style="color: #7bc275;">"xxxxxx.apps.googleusercontent.com"</span>
org-gcal-client-secret <span style="color: #7bc275;">""</span>
org-gcal-file-alist '((<span style="color: #7bc275;">"jon@pielaet.net"</span> . <span style="color: #7bc275;">"~/Dropbox/Documents/Orgzly/gcal.org"</span>)))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Syntax highlighting for org export</span>

(<span style="color: #51afef;">setq</span> org-latex-listings 'minted
      org-latex-packages-alist '((<span style="color: #7bc275;">""</span> <span style="color: #7bc275;">"minted"</span>))
      org-latex-pdf-process
      '(<span style="color: #7bc275;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
        <span style="color: #7bc275;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>))

</pre>
</div>
</div>
</div>
