config-breakdown.html
<div id="outline-container-orgb065608" class="outline-3">
<h3 id="orgb065608"><span class="section-number-3">6.5</span> func.el</h3>
<div class="outline-text-3" id="text-6-5">
<p>
(An elisp file for custom function definitions.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #62686E;">;; </span><span style="color: #62686E;">Custom Functions</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">avoid duplication of the paradox buffer if one already exists</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">otherwise create one when called</span>


(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">visit-paradox</span> ()
  <span style="color: #7e7e87;">"Create or visit a `</span><span style="color: #a991f1;">paradox</span><span style="color: #7e7e87;">' buffer."</span>
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">if</span> (not (get-buffer <span style="color: #7bc275;">"*Packages*"</span>))
      (<span style="color: #51afef;">progn</span> (split-window-sensibly (selected-window))
             (other-window 1)
             (paradox-list-packages ()))
    (switch-to-buffer-other-window <span style="color: #7bc275;">"*Packages*"</span>)))
(global-set-key (kbd <span style="color: #7bc275;">"&lt;f13&gt;"</span>)
                (<span style="color: #51afef;">lambda</span> ()
                  (<span style="color: #51afef;">interactive</span>)
                  (visit-paradox)))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">gnus</span>
(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">visit-gnus</span> ()
  <span style="color: #7e7e87;">"Create or visit a gnus buffer."</span>
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">if</span> (not (get-buffer <span style="color: #7bc275;">"*Group*"</span>))
      (<span style="color: #51afef;">progn</span> (split-window-sensibly (selected-window))
             (other-window 1)
             (gnus))
    (switch-to-buffer-other-window <span style="color: #7bc275;">"*Group*"</span>)))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">book searching</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">amazon-search</span> ()
  <span style="color: #7e7e87;">"Search amazon.com for the selected region if any, display a query prompt otherwise."</span> 
  (<span style="color: #51afef;">interactive</span>) 
  (browse-url (concat <span style="color: #7bc275;">"http://www.amazon.com/s/?url=search-alias%3Daps&amp;field-keywords="</span>
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active 
(buffer-substring 
(region-beginning) 
(region-end)) 
(read-string <span style="color: #7bc275;">"Amazon: "</span>))))))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">bookshare-catalog-search</span> ()
  <span style="color: #7e7e87;">"Search the Bookshare.org catalog for the selected region if any, display a query prompt otherwise."</span>
  (<span style="color: #51afef;">interactive</span>)
  (browse-url (concat <span style="color: #7bc275;">"https://www.bookshare.org/search?keyword="</span>
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active
(buffer-substring
(region-beginning)
(region-end))
(read-string <span style="color: #7bc275;">"Bookshare Catalog: "</span>))))))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">google-books-search</span> ()
  <span style="color: #7e7e87;">"Search Google Books for the selected region if any, display a query prompt otherwise."</span>
  (<span style="color: #51afef;">interactive</span>)
  (browse-url (concat <span style="color: #7bc275;">"https://www.google.com/search?tbm=bks&amp;q="</span> 
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active
(buffer-substring
(region-beginning)
(region-end))
(read-string
 <span style="color: #7bc275;">"Google Books: "</span>))))))


(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">powells-search</span> ()
  <span style="color: #7e7e87;">"Search the Powell's City of Books website for the selected region if any, display a query prompt otherwise."</span>
  (<span style="color: #51afef;">interactive</span>)
  (browse-url (concat <span style="color: #7bc275;">"http://www.powells.com/SearchResults?kw=title:"</span>
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active
(buffer-substring
(region-beginning)
(region-end))
(read-string
<span style="color: #7bc275;">"Powell's: "</span>))))))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">vintage-books-search</span> ()
  <span style="color: #7e7e87;">"Search vintage-books.com for the selected region if any, display a query prompt otherwise."</span>
  (<span style="color: #51afef;">interactive</span>)
  (browse-url (concat
               <span style="color: #7bc275;">"http://www.vintage-books.com/?CLSN_2361=1457058371236132db4b040a3027589f&amp;keyword="</span>
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active
(buffer-substring
(region-beginning)
(region-end))
(read-string <span style="color: #7bc275;">"Vintage Books: "</span>))))))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">worldcat-catalog-search</span> ()
  <span style="color: #7e7e87;">"Search the worldcat.org catalog for the selected region if any, display a query prompt otherwise."</span>
  (<span style="color: #51afef;">interactive</span>)
  (browse-url (concat <span style="color: #7bc275;">"https://www.worldcat.org/search?qt=worldcat_org_all&amp;q="</span>
(url-hexify-string (<span style="color: #51afef;">if</span> mark-active
(buffer-substring
(region-beginning)
(region-end))
(read-string
 <span style="color: #7bc275;">"WorldCat Catalog: "</span>))))))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">flatten all headlines in org</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">flatten-org-headlines</span> ()
  <span style="color: #7e7e87;">"Flatten all headlines in org-mode using replace-regexp"</span>
 (<span style="color: #51afef;">interactive</span>)
 (replace-regexp <span style="color: #7bc275;">"^</span><span style="color: #FCCE7B;">\</span><span style="color: #7bc275;">*+"</span> <span style="color: #7bc275;">"**"</span>))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">push-minimap-over</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">push-minimap-over</span> ()
  <span style="color: #7e7e87;">"Enlarge the main window so the minimap is a reasonable size"</span>
  (<span style="color: #51afef;">interactive</span>)
  (enlarge-window-horizontally 100))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">crush the whitespace in a buffer</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">minify-json-buffer-contents</span>()
  <span style="color: #7e7e87;">"Minifies the buffer contents by removing whitespaces."</span>
  (<span style="color: #51afef;">interactive</span>)
  (delete-whitespace-rectangle (point-min) (point-max))
  (mark-whole-buffer)
  (goto-char (point-min))
  (<span style="color: #51afef;">while</span> (search-forward <span style="color: #7bc275;">"\n"</span> nil t) (replace-match <span style="color: #7bc275;">""</span> nil t)))


<span style="color: #62686E;">;; </span><span style="color: #62686E;">function to load the emacspeak setup file</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">can be bound to a key (Esc-M-s set in keybindings.el)</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">start-speech</span> ()
  <span style="color: #7e7e87;">"Start Emacspeak"</span>
  (<span style="color: #51afef;">interactive</span>)
  (load-file <span style="color: #7bc275;">"~/emacspeak/lisp/emacspeak-setup.el"</span>)
  )

<span style="color: #62686E;">;; </span><span style="color: #62686E;">dired-sidebar</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">dired-sidebar-toggle-sidebar</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">is also bound to C-&lt;Esc&gt;</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">in keybindings.el</span>

(<span style="color: #51afef;">use-package</span> <span style="color: #a991f1;">dired-sidebar</span>
  <span style="color: #C57BDB;">:load-path</span> <span style="color: #7bc275;">"What you got from pwd."</span>
  <span style="color: #C57BDB;">:bind</span> ((<span style="color: #7bc275;">"C-x C-n"</span> . dired-sidebar-toggle-sidebar))
  <span style="color: #C57BDB;">:ensure</span> nil
  <span style="color: #C57BDB;">:commands</span> (dired-sidebar-toggle-sidebar)
  <span style="color: #C57BDB;">:config</span>
  (<span style="color: #51afef;">use-package</span> <span style="color: #a991f1;">all-the-icons-dired</span>
    <span style="color: #62686E;">;; </span><span style="color: #62686E;">M-x all-the-icons-install-fonts</span>
    <span style="color: #C57BDB;">:ensure</span> t
    <span style="color: #C57BDB;">:commands</span> (all-the-icons-dired-mode)))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">undo-tree really hates linum</span>
(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">undo-tree-visualizer-update-linum</span>
    (<span style="color: #FCCE7B;">&amp;rest</span>
     args)
  (linum-update undo-tree-visualizer-parent-buffer))
(advice-add 'undo-tree-visualize-undo
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)
(advice-add 'undo-tree-visualize-redo
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)
(advice-add 'undo-tree-visualize-undo-to-x
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)
(advice-add 'undo-tree-visualize-redo-to-x
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)
(advice-add 'undo-tree-visualizer-mouse-set
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)
(advice-add 'undo-tree-visualizer-set
            <span style="color: #C57BDB;">:after</span> #'undo-tree-visualizer-update-linum)

</pre>
</div>
</div>
</div>
