config-breakdown.org
** auto-mode-alist.el
(An elisp file to set automatic modes by file extension.)

#+BEGIN_SRC emacs-lisp :tangle yes
;; auto-mode-alist

;; Associate file extensions with a mode.

(add-to-list 'auto-mode-alist '("\\.asp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.aspx\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.bash\\'" . shell-script-mode))
(add-to-list 'auto-mode-alist '("\\.bzip2\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.cask\\'" . cask-mode ))
(add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.csv\\'" . csv-mode))
(add-to-list 'auto-mode-alist '("\\.dtd\\'" . nxml-mode))
(add-to-list 'auto-mode-alist '("\\.edn\\'" . js3-mode))
(add-to-list 'auto-mode-alist '("\\.elf\\'" . hexl-mode))
(add-to-list 'auto-mode-alist '("\\.exe\\'" . hexl-mode))
(add-to-list 'auto-mode-alist '("\\.gif\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.gitignore\\'" . gitignore-mode))
(add-to-list 'auto-mode-alist '("\\.gzip\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.hex\\'" . hexl-mode))
(add-to-list 'auto-mode-alist '("\\.hs\\'" . haskell-mode))
(add-to-list 'auto-mode-alist '("\\.htm\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.ino\\'" . arduino-mode))
(add-to-list 'auto-mode-alist '("\\.jpeg\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.jpg\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.js\\'" . js3-mode))
(add-to-list 'auto-mode-alist '("\\.json\\'" . js3-mode))
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.o\\'" . hexl-mode))
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.php\\'" . php-mode))
(add-to-list 'auto-mode-alist '("\\.png\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.pyd\\'" . cython-mode))
(add-to-list 'auto-mode-alist '("\\.pyi\\'" .  cython-mode))
(add-to-list 'auto-mode-alist '("\\.pyx\\'" . cython-mode))
(add-to-list 'auto-mode-alist '("\\.rb\\'" . inf-ruby-minor-mode))
(add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-mode))
(add-to-list 'auto-mode-alist '("\\.sh\\'" . shell-script-mode))
(add-to-list 'auto-mode-alist '("\\.so\\'" . hexl-mode))
(add-to-list 'auto-mode-alist '("\\.svg\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.tar.gz\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.tar\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.tgz\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.tif\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.tiff\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.txt\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.webp\\'" . image-mode))
(add-to-list 'auto-mode-alist '("\\.xhtml\\'" . nxml-mode))
(add-to-list 'auto-mode-alist '("\\.xz\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.zip\\'" . dired-mode))
(add-to-list 'auto-mode-alist '("\\.zsh\\'" . shell-script-mode))
#+END_SRC
** hooks.el
(An elisp file to set how modes interact.)

#+BEGIN_SRC emacs-lisp :tangle yes
;; icons in dired buffers

(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

;; clojure

(add-hook 'clojure-mode-hook #'subword-mode)
(add-hook 'clojure-mode-hook #'smartparens-strict-mode)
(add-hook 'clojure-mode-hook #'aggressive-indent-mode)
(add-hook 'clojure-mode-hook 'cider-mode)

;; nlinum

(add-hook 'prog-mode-hook 'nlinum-mode +1)
(add-hook 'emacs-lisp-mode-hook 'nlinum-mode +1)

;; enable visual line wrapping in text modes

(add-hook 'text-mode-hook 'visual-line-mode)

;; enable yasnippet selectively in some modes

(add-hook 'android-mode-hook 'yas-minor-mode +1)
(add-hook 'arduino-mode-hook 'yas-minor-mode +1)
(add-hook 'c++-mode-hook 'yas-minor-mode +1)
(add-hook 'c-mode-hook 'yas-minor-mode +1)
(add-hook 'clojure-mode-hook 'yas-minor-mode +1)
(add-hook 'edn-mode-hook 'yas-minor-mode +1)
(add-hook 'ein-mode-hook 'yas-minor-mode +1)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode +1)
(add-hook 'go-mode-hook 'yas-minor-mode +1)
(add-hook 'haskell-mode-hook 'yas-minor-mode +1)
(add-hook 'java-mode-hook 'yas-minor-mode +1)
(add-hook 'js2-mode-hook 'yas-minor-mode +1)
(add-hook 'lisp-interaction-mode-hook 'yas-minor-mode +1)
(add-hook 'fundemental-mode-hook 'yas-minor-mode +1)
(add-hook 'markdown-mode-hook 'yas-minor-mode +1)
(add-hook 'nxml-mode-hook 'yas-minor-mode +1)
(add-hook 'org-mode-hook 'yas-minor-mode +1)
(add-hook 'perl-mode-hook 'yas-minor-mode +1)
(add-hook 'php-mode-hook 'yas-minor-mode +1)
(add-hook 'python-mode-hook 'yas-minor-mode +1)
(add-hook 'ruby-mode-hook 'yas-minor-mode +1)
(add-hook 'rust-mode-hook 'yas-minor-mode +1)
(add-hook 'scala-mode-hook 'yas-minor-mode +1)
(add-hook 'shell-mode-hook 'yas-minor-mode +1)
(add-hook 'web-mode-hook 'yas-minor-mode +1)
(add-hook 'yaml-mode-hook 'yas-minor-mode +1)

;; gnus

(add-hook 'gnus-startup-hook 'bbdb-insinuate-gnus)

;; company

(add-hook 'lisp-interaction-mode-hook
          (lambda ()
            (set (make-local-variable 'company-backends)
                 '(company-elisp))))

;; org-gcal-sync

(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
#+END_SRC
