config-breakdown.html
<div id="outline-container-orgf30c1c5" class="outline-3">
<h3 id="orgf30c1c5"><span class="section-number-3">6.6</span> auto-mode-alist.el</h3>
<div class="outline-text-3" id="text-6-6">
<p>
(An elisp file to set automatic modes by file extension.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">auto-mode-alist</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Associate file extensions with a mode.</span>

(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.asp\\'"</span> . web-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.aspx\\'"</span> . web-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.bash\\'"</span> . shell-script-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.bzip2\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.cask\\'"</span> . cask-mode ))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.css\\'"</span> . web-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.csv\\'"</span> . csv-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.dtd\\'"</span> . nxml-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.edn\\'"</span> . js3-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.elf\\'"</span> . hexl-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.exe\\'"</span> . hexl-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.gif\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.gitignore\\'"</span> . gitignore-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.gzip\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.hex\\'"</span> . hexl-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.hs\\'"</span> . haskell-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.htm\\'"</span> . web-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.html\\'"</span> . web-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.ino\\'"</span> . arduino-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.jpeg\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.jpg\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.js\\'"</span> . js3-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.json\\'"</span> . js3-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.markdown\\'"</span> . markdown-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.md\\'"</span> . markdown-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.o\\'"</span> . hexl-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.pdf\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.php\\'"</span> . php-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.png\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.pyd\\'"</span> . cython-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.pyi\\'"</span> .  cython-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.pyx\\'"</span> . cython-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.rb\\'"</span> . inf-ruby-minor-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.rs\\'"</span> . rust-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.sh\\'"</span> . shell-script-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.so\\'"</span> . hexl-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.svg\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.tar.gz\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.tar\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.tgz\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.tif\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.tiff\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.txt\\'"</span> . markdown-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.webp\\'"</span> . image-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.xhtml\\'"</span> . nxml-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.xz\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.zip\\'"</span> . dired-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #7bc275;">"\\.zsh\\'"</span> . shell-script-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf46ad8" class="outline-3">
<h3 id="orgdf46ad8"><span class="section-number-3">6.7</span> hooks.el</h3>
<div class="outline-text-3" id="text-6-7">
<p>
(An elisp file to set how modes interact.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">icons in dired buffers</span>

(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">clojure</span>

(add-hook 'clojure-mode-hook #'subword-mode)
(add-hook 'clojure-mode-hook #'smartparens-strict-mode)
(add-hook 'clojure-mode-hook #'aggressive-indent-mode)
(add-hook 'clojure-mode-hook 'cider-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">nlinum</span>

(add-hook 'prog-mode-hook 'nlinum-mode +1)
(add-hook 'emacs-lisp-mode-hook 'nlinum-mode +1)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">enable visual line wrapping in text modes</span>

(add-hook 'text-mode-hook 'visual-line-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">enable yasnippet selectively in some modes</span>

(add-hook 'android-mode-hook 'yas-minor-mode +1)
(add-hook 'arduino-mode-hook 'yas-minor-mode +1)
(add-hook 'c++-mode-hook 'yas-minor-mode +1)
(add-hook 'c-mode-hook 'yas-minor-mode +1)
(add-hook 'clojure-mode-hook 'yas-minor-mode +1)
(add-hook 'edn-mode-hook 'yas-minor-mode +1)
(add-hook 'ein-mode-hook 'yas-minor-mode +1)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode +1)
(add-hook 'go-mode-hook 'yas-minor-mode +1)
(add-hook 'haskell-mode-hook 'yas-minor-mode +1)
(add-hook 'java-mode-hook 'yas-minor-mode +1)
(add-hook 'js2-mode-hook 'yas-minor-mode +1)
(add-hook 'lisp-interaction-mode-hook 'yas-minor-mode +1)
(add-hook 'fundemental-mode-hook 'yas-minor-mode +1)
(add-hook 'markdown-mode-hook 'yas-minor-mode +1)
(add-hook 'nxml-mode-hook 'yas-minor-mode +1)
(add-hook 'org-mode-hook 'yas-minor-mode +1)
(add-hook 'perl-mode-hook 'yas-minor-mode +1)
(add-hook 'php-mode-hook 'yas-minor-mode +1)
(add-hook 'python-mode-hook 'yas-minor-mode +1)
(add-hook 'ruby-mode-hook 'yas-minor-mode +1)
(add-hook 'rust-mode-hook 'yas-minor-mode +1)
(add-hook 'scala-mode-hook 'yas-minor-mode +1)
(add-hook 'shell-mode-hook 'yas-minor-mode +1)
(add-hook 'web-mode-hook 'yas-minor-mode +1)
(add-hook 'yaml-mode-hook 'yas-minor-mode +1)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">gnus</span>

(add-hook 'gnus-startup-hook 'bbdb-insinuate-gnus)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">company</span>

(add-hook 'lisp-interaction-mode-hook
          (<span style="color: #51afef;">lambda</span> ()
            (set (make-local-variable 'company-backends)
                 '(company-elisp))))

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org-gcal-sync</span>

(add-hook 'org-agenda-mode-hook (<span style="color: #51afef;">lambda</span> () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (<span style="color: #51afef;">lambda</span> () (org-gcal-sync) ))
</pre>
</div>
</div>
</div>
