config-breakdown.html
<div id="outline-container-orgcc6bf56" class="outline-3">
<h3 id="orgcc6bf56"><span class="section-number-3">6.8</span> keybindings.el</h3>
<div class="outline-text-3" id="text-6-8">
<p>
(An elisp file to set custom key sequences and shortcuts in Emacs.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">Keybindings originally for the kinesis advantage</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">wizard-keys</span> ()
  <span style="color: #7e7e87;">"keybindings for wizard-mode"</span>

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">testing keys</span>

  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;up&gt;"</span>) 'backward-page)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;down&gt;"</span>) 'forward-page)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">emacspeak</span>

  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;f6&gt;"</span>) 'toggle-tones)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;pause&gt;"</span>)'emacspeak-speak-buffer-interactively)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;pause&gt;"</span>)'emacspeak-speak-buffer-filename)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">completion</span>

  (global-set-key <span style="color: #7bc275;">"\t"</span> 'indent-relative)

  <span style="color: #62686E;">;;  </span><span style="color: #62686E;">(global-set-key "\t" 'company-complete-common)</span>
  (global-set-key (kbd <span style="color: #7bc275;">"C--"</span>) 'hippie-expand)
  (global-set-key (kbd <span style="color: #7bc275;">"C-0"</span>) 'company-complete)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">text scrubbing</span>

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">visual regexp</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-q"</span>) 'vr/query-replace)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-r"</span>) 'vr/replace)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">ag</span>

  (global-set-key (kbd <span style="color: #7bc275;">"M-g d"</span>) 'ag-dired)
  (global-set-key (kbd <span style="color: #7bc275;">"M-g f"</span>) 'ag-files)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">avy</span>

  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;Scroll_Lock&gt;"</span>) 'avy-pop-mark)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-c"</span>) 'avy-goto-char)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-w"</span>) 'avy-goto-word-0)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-l"</span>) 'avy-goto-line)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">whitespace</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-="</span>) 'fixup-whitespace)


  <span style="color: #62686E;">;; </span><span style="color: #62686E;">thumb keys (kinesis advantage)</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;end&gt;"</span>) 'action-key)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;prior&gt;"</span>) 'hyperbole)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;next&gt;"</span>) 'dtk-stop)
  (global-set-key (kbd <span style="color: #7bc275;">"s-&lt;next&gt;"</span>) 'ace-window)
  (global-set-key (kbd <span style="color: #7bc275;">"s-&lt;prior&gt;"</span>) 'ace-window)
  (global-set-key (kbd <span style="color: #7bc275;">"C-M-&lt;next&gt;"</span>) 'next-buffer)
  (global-set-key (kbd <span style="color: #7bc275;">"C-M-&lt;prior&gt;"</span>) 'previous-buffer)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;home&gt;"</span>) 'keyboard-escape-quit)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;prior&gt;"</span>) 'scroll-down-command)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;next&gt;"</span>) 'scroll-up-command)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;home&gt;"</span>) 'move-beginning-of-line)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;end&gt;"</span>) 'move-end-of-line)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;next&gt;"</span>) 'ace-window)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;prior&gt;"</span>) 'ace-window)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">ui</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-h"</span>) 'hyperbole)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-\\"</span>) 'hidden-mode-line-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;tab&gt;"</span>) 'ace-window)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; &lt;ESC&gt; &lt;ESC&gt;"</span>) 'keyboard-escape-quit)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-b"</span>) 'helm-buffers-list)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;mouse-8&gt;"</span>) 'previous-buffer)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;mouse-9&gt;"</span>)'next-buffer)
  (global-set-key (kbd <span style="color: #7bc275;">"M-X"</span>) 'smex-major-mode-commands)
  (global-set-key (kbd <span style="color: #7bc275;">"M-x"</span>) 'smex)
  (global-set-key (kbd <span style="color: #7bc275;">"C-c C-c M-x"</span>) 'execute-extended-command)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f1&gt;"</span>) 'helm-buffers-list)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f2&gt;"</span>) 'helm-company)
  (global-set-key (kbd <span style="color: #7bc275;">"M-&lt;f1&gt;"</span>) 'helm-mt)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;f12&gt;"</span>) 'hidden-mode-line-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"C-&lt;f2&gt;"</span>)
                  (<span style="color: #51afef;">lambda</span> ()
                    (<span style="color: #51afef;">interactive</span>)
                    (find-file <span style="color: #7bc275;">"~/.emacs"</span>)))

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;C-f3&gt;"</span>)
                  (<span style="color: #51afef;">lambda</span> ()
                    (<span style="color: #51afef;">interactive</span>)
                    (switch-to-buffer <span style="color: #7bc275;">"*Messages*"</span>)))
  (global-set-key (kbd  <span style="color: #7bc275;">"&lt;ESC&gt; M-a"</span>)
                  (<span style="color: #51afef;">lambda</span> ()
                    (<span style="color: #51afef;">interactive</span>)
                    (find-file <span style="color: #7bc275;">"~/.emacs.d/mma.org"</span>)))


  <span style="color: #62686E;">;; </span><span style="color: #62686E;">major modes</span>


  <span style="color: #62686E;">;; </span><span style="color: #62686E;">multi-term alist</span>
  (<span style="color: #51afef;">defcustom</span> <span style="color: #DFDFDF;">term-unbind-key-list</span> '(<span style="color: #7bc275;">"M-["</span> <span style="color: #7bc275;">"C-z"</span> <span style="color: #7bc275;">"C-x"</span> <span style="color: #7bc275;">"C-c"</span> <span style="color: #7bc275;">"C-h"</span> <span style="color: #7bc275;">"C-y"</span> <span style="color: #7bc275;">"&lt;ESC&gt;"</span>)
    <span style="color: #7e7e87;">"The key list that will need to be unbind."</span>
    <span style="color: #C57BDB;">:type</span> 'list
    <span style="color: #C57BDB;">:group</span> 'multi-term)
  (<span style="color: #51afef;">defcustom</span> <span style="color: #DFDFDF;">term-bind-key-alist</span>
    '((<span style="color: #7bc275;">"C-c C-c"</span> . term-interrupt-subjob)
      (<span style="color: #7bc275;">"C-p"</span> . previous-line)
      (<span style="color: #7bc275;">"C-n"</span> . next-line)
      (<span style="color: #7bc275;">"C-s"</span> . isearch-forward)
      (<span style="color: #7bc275;">"C-r"</span> . isearch-backward)
      (<span style="color: #7bc275;">"C-m"</span> . term-send-raw)
      (<span style="color: #7bc275;">"M-f"</span> . term-send-forward-word)
      (<span style="color: #7bc275;">"M-b"</span> . term-send-backward-word)
      (<span style="color: #7bc275;">"M-o"</span> . term-send-backspace)
      (<span style="color: #7bc275;">"M-p"</span> . term-send-up)
      (<span style="color: #7bc275;">"M-n"</span> . term-send-down)
      (<span style="color: #7bc275;">"M-M"</span> . term-send-forward-kill-word)
      (<span style="color: #7bc275;">"M-N"</span> . term-send-backward-kill-word)
      (<span style="color: #7bc275;">"M-r"</span> . term-send-reverse-search-history)
      (<span style="color: #7bc275;">"M-,"</span> . term-send-input)
      (<span style="color: #7bc275;">"M-."</span> . comint-dynamic-complete))
    <span style="color: #7e7e87;">"The key alist that will need to be bind."</span>
    <span style="color: #C57BDB;">:type</span> 'alist
    <span style="color: #C57BDB;">:group</span> 'multi-term)
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">erc hide-join-part-quit-key</span>
  (eval-after-load <span style="color: #7bc275;">"erc"</span> '(<span style="color: #51afef;">progn</span> (define-key erc-mode-map <span style="color: #7bc275;">"C-M-h"</span>
                                   (<span style="color: #51afef;">lambda</span> ()
                                     (<span style="color: #51afef;">interactive</span> <span style="color: #7bc275;">""</span>)
                                     (<span style="color: #51afef;">setq</span> erc-hide-list '(<span style="color: #7bc275;">"JOIN"</span> <span style="color: #7bc275;">"PART"</span> <span style="color: #7bc275;">"QUIT"</span>))))))

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">counsel-spotify</span>
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">skip around playlists in the official spotify app via D-bus service</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-n"</span>) 'counsel-spotify-next)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-p"</span>) 'counsel-spotify-previous)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-&lt;SPC&gt;"</span>) 'counsel-spotify-toggle-play-pause)

  <span style="color: #62686E;">;; </span><span style="color: #62686E;">magit</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-;"</span>) 'magit-status)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">mode switching</span>
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">keys to switch between different modes</span>

  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f5&gt;"</span>) 'nlinum-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f6&gt;"</span>) 'ispell-word)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-i"</span>) 'ispell-word)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f7&gt;"</span>) 'flyspell-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f8&gt;"</span>) 'dired-sidebar-toggle-sidebar)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f9&gt;"</span>) 'minimap-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;f12&gt;"</span>) 'menu-bar-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;C-f5&gt;"</span>) 'scroll-bar-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;C-f7&gt;"</span>)'flycheck-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;C-f8&gt;"</span>) 'tabbar-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-R"</span>) 'yas-reload-all)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-d"</span>) 'dired)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-f"</span>) 'flyspell)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-g"</span>) 'visit-gnus)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-m"</span>) 'markdown-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-o"</span>) 'org-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-v"</span>) 'visit-paradox)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-s"</span>) 'start-speech)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-t"</span>) 'multi-term)
  (global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-y"</span>) 'yas-minor-mode)
  (global-set-key (kbd <span style="color: #7bc275;">"C-s-SPC"</span>) 'dtk-stop))

(wizard-keys)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">sudo-prepend</span>

(fset 'sudo-prepend-up [up home ?s ?u ?d ?o ?  end])
(fset 'sudo-prepend [home ?s ?u ?d ?o ?  end])

<span style="color: #62686E;">;; </span><span style="color: #62686E;">easy-kill</span>

(global-set-key [remap kill-ring-save] 'easy-kill)
(global-set-key [remap mark-sexp] 'easy-mark)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">aptitude search key bindings for paradox</span>

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">my-paradox-mode-keys</span> ()
  <span style="color: #7e7e87;">"Modify keymaps used by paradox to make searching easier."</span>
  (local-set-key (kbd <span style="color: #7bc275;">"/"</span>) 'isearch-forward-regexp)
  (local-set-key (kbd <span style="color: #7bc275;">"-"</span>) 'isearch-backward-regexp))
(add-hook 'paradox-menu-mode-hook 'my-paradox-mode-keys)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">org-agenda</span>

(define-key global-map <span style="color: #7bc275;">"\C-cl"</span> 'org-store-link)
(define-key global-map <span style="color: #7bc275;">"\C-ca"</span> 'org-agenda)


<span style="color: #62686E;">;; </span><span style="color: #62686E;">window resizing</span>

(global-set-key (kbd <span style="color: #7bc275;">"C-s-&lt;left&gt;"</span>) 'shrink-window-horizontally)
(global-set-key (kbd <span style="color: #7bc275;">"C-s-&lt;right&gt;"</span>) 'enlarge-window-horizontally)
(global-set-key (kbd <span style="color: #7bc275;">"C-s-&lt;down&gt;"</span>) 'shrink-window)
(global-set-key (kbd <span style="color: #7bc275;">"C-s-&lt;up&gt;"</span>) 'enlarge-window)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">dired-sidebar</span>

(global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-z"</span>) 'dired-sidebar-toggle-sidebar)
(global-set-key (kbd <span style="color: #7bc275;">"C-&lt;escape&gt;"</span>) 'dired-sidebar-toggle-sidebar)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">paradox upgrade packages </span>

(global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-u"</span>) 'paradox-upgrade-packages)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">mini</span>

(global-set-key (kbd <span style="color: #7bc275;">"&lt;ESC&gt; M-/"</span>) 'minimap-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">atreus window keys</span>

(global-set-key (kbd <span style="color: #7bc275;">"C-x p"</span>) 'delete-window)
(global-set-key (kbd <span style="color: #7bc275;">"C-x q"</span>) 'delete-other-windows)
(global-set-key (kbd <span style="color: #7bc275;">"C-x w"</span>) 'split-window-below)
(global-set-key (kbd <span style="color: #7bc275;">"C-x t"</span>) 'make-frame-command)

</pre>
</div>
</div>
</div>
