config-breakdown.org
** modes.el
(An elisp file to customize modes. This includes, global modes, and 
the initialization of the Emacspeak text-to-speech subsystem.)

#+BEGIN_SRC emacs-lisp :tangle yes

;; smex

(smex-initialize)

;; global modes

(global-company-mode)
(global-magit-file-mode)
(global-prettify-symbols-mode)
(solaire-global-mode)
(smartparens-global-mode)
(global-undo-tree-mode)
(global-git-gutter+-mode)

;; Emacspeak (global-voice-lock-mode)
;; uncomment the following line to load speech during init

(load-file "~/emacspeak/lisp/emacspeak-setup.el")

;; livedown
;; live markdown previews in the browser
;; https://github.com/shime/emacs-livedown

;; This package is NOT in MELPA
;; install it manually and then uncomment these lines

;;(add-to-list 'load-path "~/.emacs.d/elpa/livedown")
;;(load "livedown")

#+END_SRC

** init-packages.el
(An elisp file to make sure the package management tools are installed.)

 #+BEGIN_SRC emacs-lisp :tangle yes
;; Make sure async, paradox, and use-package are installed before proceeding to install other packages

(defvar init-packages
  '(async ;; https://github.com/jwiegley/emacs-async
paradox ;; paradox  ;; https://github.com/Malabarba/paradox
use-package) ;; https://github.com/jwiegley/use-package
"A list of packages to init are installed at launch.")

(defun init-packages-package-installed-p (p)
  (cond ((package-installed-p p) t)
	(t nil)))

(defun init-packages-installed-p ()
  (mapcar 'init-packages-package-installed-p init-packages))

(defun init-packages-install-missing ()
  (interactive)
  (unless (every 'identity (init-packages-installed-p))
  ;; check for new packages (package versions)
  (message "%s" "Emacs is now refreshing its package database...")
  (package-refresh-contents)
  (message "%s" " done.")
  ;; install the missing packages
  (dolist (p init-packages)
    (when (not (package-installed-p p))
      (package-install p)))))

(provide 'init-packages)

(init-packages-install-missing)
#+END_SRC
