config-breakdown.html
<div id="outline-container-org9c8c74c" class="outline-3">
<h3 id="org9c8c74c"><span class="section-number-3">6.9</span> modes.el</h3>
<div class="outline-text-3" id="text-6-9">
<p>
(An elisp file to customize modes. This includes, global modes, and 
the initialization of the Emacspeak text-to-speech subsystem.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #62686E;">;; </span><span style="color: #62686E;">smex</span>

(smex-initialize)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">global modes</span>

(global-company-mode)
(global-magit-file-mode)
(global-prettify-symbols-mode)
(solaire-global-mode)
(smartparens-global-mode)
(global-undo-tree-mode)
(global-git-gutter+-mode)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Emacspeak (global-voice-lock-mode)</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">uncomment the following line to load speech during init</span>

(load-file <span style="color: #7bc275;">"~/emacspeak/lisp/emacspeak-setup.el"</span>)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">livedown</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">live markdown previews in the browser</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/shime/emacs-livedown</span>

<span style="color: #62686E;">;; </span><span style="color: #62686E;">This package is NOT in MELPA</span>
<span style="color: #62686E;">;; </span><span style="color: #62686E;">install it manually and then uncomment these lines</span>

<span style="color: #62686E;">;;</span><span style="color: #62686E;">(add-to-list 'load-path "~/.emacs.d/elpa/livedown")</span>
<span style="color: #62686E;">;;</span><span style="color: #62686E;">(load "livedown")</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org716550d" class="outline-3">
<h3 id="org716550d"><span class="section-number-3">6.10</span> init-packages.el</h3>
<div class="outline-text-3" id="text-6-10">
<p>
(An elisp file to make sure the package management tools are installed.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">Make sure async, paradox, and use-package are installed before proceeding to install other packages</span>

(<span style="color: #51afef;">defvar</span> <span style="color: #DFDFDF;">init-packages</span>
  '(async <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jwiegley/emacs-async</span>
paradox <span style="color: #62686E;">;; </span><span style="color: #62686E;">paradox  ;; https://github.com/Malabarba/paradox</span>
use-package) <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jwiegley/use-package</span>
<span style="color: #7e7e87;">"A list of packages to init are installed at launch."</span>)

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">init-packages-package-installed-p</span> (p)
  (<span style="color: #51afef;">cond</span> ((package-installed-p p) t)
        (t nil)))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">init-packages-installed-p</span> ()
  (mapcar 'init-packages-package-installed-p init-packages))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">init-packages-install-missing</span> ()
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">unless</span> (every 'identity (init-packages-installed-p))
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">check for new packages (package versions)</span>
  (message <span style="color: #7bc275;">"%s"</span> <span style="color: #7bc275;">"Emacs is now refreshing its package database..."</span>)
  (package-refresh-contents)
  (message <span style="color: #7bc275;">"%s"</span> <span style="color: #7bc275;">" done."</span>)
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">install the missing packages</span>
  (<span style="color: #51afef;">dolist</span> (p init-packages)
    (<span style="color: #51afef;">when</span> (not (package-installed-p p))
      (package-install p)))))

(<span style="color: #51afef;">provide</span> '<span style="color: #a991f1;">init-packages</span>)

(init-packages-install-missing)
</pre>
</div>
</div>
</div>
