config-breakdown.html
<div id="outline-container-org5ec2046" class="outline-3">
<h3 id="org5ec2046"><span class="section-number-3">6.11</span> ensure-packages.el</h3>
<div class="outline-text-3" id="text-6-11">
<p>
(An elisp file to ensure Emacs packages are installed.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #62686E;">;; </span><span style="color: #62686E;">Make sure these packages are installed</span>

(<span style="color: #51afef;">defvar</span> <span style="color: #DFDFDF;">ensure-packages</span>
  '(ac-cider <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/clojure-emacs/ac-cider</span>
ac-clang <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yaruopooner/ac-clang</span>
ac-helm  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yasuyk/ac-helm</span>
ac-html  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/cheunghy/ac-html</span>
ac-html-angular <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/osv/ac-html-bootstrap</span>
ac-html-bootstrap <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/osv/ac-html-bootstrap</span>
ac-html-csswatcher  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/osv/ac-html-csswatcher</span>
ac-inf-ruby <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/purcell/ac-inf-ruby</span>
ac-ispell  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/syohex/emacs-ac-ispell</span>
ac-js2  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ScottyB/ac-js2</span>
ac-math <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/vitoshka/ac-math</span>
ac-php <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/xcwen/ac-php</span>
ac-rtags <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://rtags.net</span>
ace-flyspell <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/cute-jumper/ace-flyspell</span>
ace-isearch <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/tam17aki/ace-isearch</span>
ace-link <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/ace-link</span>
ace-mc <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/mm--/ace-mc</span>
ace-window <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/ace-window</span>
adafruit-wisdom <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/gonewest818/adafruit-wisdom.el</span>
adaptive-wrap <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/adaptive-wrap.html</span>
adjust-parens <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/adjust-parens.html</span>
aggressive-indent <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Malabarba/aggressive-indent-mode</span>
all-the-icons-dired <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jtbm37/all-the-icons-dired</span>
all-the-icons-gnus <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/nlamirault/all-the-icons-gnus</span>
all-the-icons-ivy <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/asok/all-the-icons-ivy</span>
ample-regexps <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/immerrr/ample-regexps.el</span>
ample-theme   <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jordonbiondo/ample-theme</span>
android-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/remvee/android-mode</span>
applescript-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ieure/applescript-mode</span>
arduino-mode  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/stardiviner/arduino-mode</span>
auctex <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.gnu.org/software/auctex/</span>
avy  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/avy</span>
bash-completion <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/szermatt/emacs-bash-completion</span>
bbdb <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://elpa.gnu.org/packages/bbdb.html</span>
beacon <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Malabarba/beacon</span>
bind-chord <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/waymondo/use-package-chords</span>
browse-kill-ring <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/browse-kill-ring/browse-kill-ring</span>
bug-hunter  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Malabarba/elisp-bug-hunter</span>
calfw  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kiwanami/emacs-calfw</span>
calfw-gcal <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/myuhe/calfw-gcal.el</span>
calfw-ical <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kiwanami/emacs-calfw</span>
calfw-org <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kiwanami/emacs-calfw</span>
cask <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/cask/cask</span>
chess  <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/chess.html</span>
cider <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.github.com/clojure-emacs/cider</span>
cider-decompile <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.github.com/clojure-emacs/cider-decompile</span>
clj-refactor <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/clojure-emacs/clj-refactor.el</span>
cljr-helm <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/philjackson/cljr-helm</span>
clojure-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/clojure-emacs/clojure-mode</span>
clojure-mode-extra-font-locking <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/clojure-emacs/clojure-mode</span>
coffee-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/defunkt/coffee-mode/</span>
company <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://company-mode.github.io/</span>
company-arduino <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yuutayamada/company-arduino</span>
company-auctex <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/alexeyr/company-auctex/</span>
company-c-headers <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/randomphrase/company-c-headers</span>
company-dict <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/hlissner/emacs-company-dict</span>
company-ghc <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/iquiw/company-ghc</span>
company-go <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/mdempsky/gocode</span>
company-inf-ruby <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/company-mode/company-inf-ruby</span>
company-irony <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Sarcasm/company-irony/</span>
company-jedi <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/syohex/emacs-company-jedi</span>
company-math <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/vspinu/company-math</span>
company-php <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/xcwen/ac-php</span>
company-rtags <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://rtags.net</span>
company-shell <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Alexander-Miller/company-shell</span>
company-statistics <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/company-mode/company-statistics</span>
company-suggest <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/juergenhoetzel/company-suggest</span>
company-tern <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/proofit404/company-tern</span>
company-try-hard <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Wilfred/company-try-hard</span>
company-web <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/osv/company-web</span>
concurrent <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kiwanami/emacs-deferred/</span>
counsel <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/swiper</span>
counsel-tramp <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/masasam/emacs-counsel-tramp</span>
crux <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/bbatsov/crux</span>
csv-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/csv-mode.html</span>
cython-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/cython/cython</span>
diff-hl <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/dgutov/diff-hl</span>
diffview <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/mgalgs/diffview-mode</span>
dired-sidebar <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jojojames/dired-sidebar</span>
direx <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/m2ym/direx-el</span>
direx-grep <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/aki2o/direx-grep</span>
dismal <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/dismal.html</span>
dockerfile-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/spotify/dockerfile-mode</span>
doom-modeline <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/seagle0128/doom-modeline</span>
doom-themes <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/hlissner/emacs-doom-theme</span>
dotnet <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/julienXX/dotnet.el</span>
dropbox <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/pavpanchekha/dropbox.el</span>
dumb-jump <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jacktasia/dumb-jump</span>
easy-kill  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/leoliu/easy-kill</span>
edn <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://www.github.com/expez/edn.el</span>
ein  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/millejoh/emacs-ipython-notebook</span>
el-get <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.emacswiki.org/emacs/el-get</span>
elfeed  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/skeeto/elfeed</span>
elfeed-goodies <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/algernon/elfeed-goodies</span>
elfeed-org <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/remyhonig/elfeed-org</span>
elfeed-protocol <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/fasheng/elfeed-protocol</span>
elfeed-web <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/skeeto/elfeed</span>
elisp-format  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Yuki-Inoue/elisp-format</span>
elisp-lint <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/gonewest818/elisp-lint/</span>
emmet-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/smihica/emmet-mode</span>
emms <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.gnu.org/software/emms/</span>
ensime <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ensime/ensime-emacs</span>
erc-colorize <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/thisirs/erc-colorize.git</span>
erc-hl-nicks <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.github.com/leathekd/erc-hl-nicks</span>
erc-status-sidebar <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/drewbarbs/erc-status-sidebar</span>
erc-tweet  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kidd/erc-tweet.el</span>
erc-twitch <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/vibhavp/erc-twitch</span>
erc-youtube <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kidd/erc-youtube.el</span>
erlang <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/erlang/otp</span>
ess <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://ess.r-project.org/</span>
evil-lispy <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/sp3ctum/evil-lispy</span>
evil-mc  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/gabesoft/evil-mc</span>
evil-mc-extras <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/gabesoft/evil-mc-extras</span>
expand-region <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/magnars/expand-region.el</span>
flycheck <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.flycheck.org</span>
flycheck-rtags <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://rtags.net</span>
free-keys <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Fuco1/free-keys</span>
gist <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/defunkt/gist.el</span>
git-gutter+ <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/nonsequitur/git-gutter-plus</span>
git-gutter-fringe+  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/nonsequitur/git-gutter-fringe-plus</span>
github-explorer <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/TxGVNN/github-explorer</span>
gmail2bbdb <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/redguardtoo/gmail2bbdb</span>
gnugo <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.gnuvola.org/software/gnugo/</span>
go-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/dominikh/go-mode.el</span>
google-c-style <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/google/styleguide</span>
google-translate <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/atykhonov/google-translate</span>
haskell-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/haskell/haskell-mode~</span>
helm <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://emacs-helm.github.io/helm/</span>
helm-ag <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/syohex/emacs-helm-ag</span>
helm-ag-r <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yuutayamada/helm-ag-r</span>
helm-aws <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/istib/helm-aws</span>
helm-chrome <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kawabata/helm-chrome</span>
helm-cider <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/clojure-emacs/helm-cider</span>
helm-cider-history <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Kungi/helm-cider-history</span>
helm-company <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Sodel-the-Vociferous/helm-company</span>
helm-dired-history <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jixiuf/helm-dired-history</span>
helm-dired-recent-dirs <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yynozk/helm-dired-recent-dirs </span>
helm-emmet <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yasuyk/helm-emmet</span>
helm-emms <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/emacs-helm/helm-emms</span>
helm-eww <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/emacs-helm/helm-eww</span>
helm-git <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/maio/helm-git</span>
helm-git-files <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kenbeese/helm-git-files</span>
helm-git-grep <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yasuyk/helm-git-grep</span>
helm-github-stars <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Sliim/helm-github-stars</span>
helm-gitignore <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jupl/helm-gitignore</span>
helm-google <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://framagit.org/steckerhalter/helm-google</span>
helm-flycheck <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yasuyk/helm-flycheck</span>
helm-flyspell <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/pronobis/helm-flyspell</span>
helm-ispell <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/syohex/emacs-helm-ispell</span>
helm-jira <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/DeX3/helm-jira</span>
helm-lines <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/torgeir/helm-lines.el/</span>
helm-lastpass <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/xuchunyang/helm-lastpass</span>
helm-ls-git <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/emacs-helm/helm-ls-git</span>
helm-make <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/helm-make</span>
helm-mt <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/dfdeshom/helm-mt</span>
helm-open-github <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/syohex/emacs-helm-open-github</span>
helm-org-rifle <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/alphapapa/helm-org-rifle</span>
helm-rtags <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://rtags.net</span>
helm-smex <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ptrv/helm-smex</span>
helm-spotify-plus  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/wandersoncferreira/helm-spotify-plus</span>
helm-swoop <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ShingoFukuyama/helm-swoop</span>
helm-systemd <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Lompik/helm-systemd</span>
helm-tramp <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/masasam/emacs-helm-tramp</span>
helm-unicode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/bomgar/helm-unicode</span>
helm-w3m <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/emacs-helm/helm-w3m</span>
helm-wordnet <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/raghavgautam/helm-wordnet</span>
helm-youtube <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/maximus12793/helm-youtube</span>
hide-mode-line <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/hlissner/emacs-hide-mode-line</span>
hyperbole <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.gnu.org/software/hyperbole</span>
indent-guide <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://hins11.yu-yake.com/</span>
inf-clojure  <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/clojure-emacs/inf-clojure</span>
inf-ruby <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/nonsequitur/inf-ruby</span>
ivy-hydra <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/swiper</span>
ivy-rtags <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://rtags.net</span>
ioccur  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/thierryvolpiatto/ioccur</span>
jedi <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/tkf/emacs-jedi</span>
js3-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/tamzinblake/js3-mode</span>
json-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/joshwnj/json-mode</span>
json-reformat <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/gongo/json-reformat</span>
kaleidoscope <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/algernon/kaleidoscope.el</span>
kaleidoscope-evil-state-flash <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/algernon/kaleidoscope.el</span>
magit <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/magit/magit</span>
magit-annex  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/magit/magit-annex</span>
magit-lfs <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ailrun/magit-lfs</span>
magit-popup <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/magit/magit-popup</span>
magithub <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/vermiculus/magithub</span>
matlab-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://sourceforge.net/projects/matlab-emacs/</span>
md4rd <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ahungry/md4rd</span>
minimap <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/minimap.html</span>
multi-term <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.emacswiki.org/emacs/download/multi-term.el</span>
neotree <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jaypei/emacs-neotree</span>
nlinum <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://elpa.gnu.org/packages/nlinum.html</span>
oauth <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/psanford/emacs-oauth</span>
ob-ipython <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.gregsexton.org</span>
olivetti <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/rnkn/olivetti</span>
omnisharp <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Omnisharp/omnisharp-emacs</span>
org <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://orgmode.org/</span>
org-brain <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/Kungsgeten/org-brain</span>
org-download <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/abo-abo/org-download</span>
org-jira <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ahungry/org-jira</span>
org-journal <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/bastibe/org-journal</span>
org-mind-map <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/theodorewiles/org-mind-map</span>
org-plus-contrib <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://orgmode.org/</span>
org-pomodoro <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/lolownia/org-pomodoro</span>
org-projectile <span style="color: #62686E;">;;</span><span style="color: #62686E;">https://github.com/IvanMalison/org-projectile</span>
org-projectile-helm <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/IvanMalison/org-projectile</span>
org-ref <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jkitchin/org-ref</span>
org-timeline <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Fuco1/org-timeline/</span>
org-web-tools <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/alphapapa/org-web-tools</span>
org2jekyll <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ardumont/org2jekyll</span>
ox-epub <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/ofosos/org-epub</span>
ox-html5slide <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/coldnew/org-html5slide</span>
ox-pandoc <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/kawabata/ox-pandoc</span>
ox-reveal <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yjwen/org-reveal</span>
pabbrev <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/phillord/pabbrev</span>
pandoc-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/joostkremers/pandoc-mode</span>
pdf-tools <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/politza/pdf-tools</span>
pdf-view-restore <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/007kevin/pdf-view-restore</span>
pianobar <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/agrif/pianobar.el</span>
powerline <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/milkypostman/powerline/</span>
powershell <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/jschaf/powershell.el</span>
projectile  <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/bbatsov/projectile</span>
pretty-symbols <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/drothlis/pretty-symbols</span>
pylint <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/PyCQA/pylint</span>
realgud <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/realgud/realgud/</span>
robe <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/dgutov/robe</span>
rubocop <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/rubocop-hq/rubocop-emacs</span>
rubocopfmt <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/jimeh/rubocopfmt.el</span>
salesforce-utils <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/grimnebulin/emacs-salesforce</span>
sauron <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/djcb/sauron</span>
scala-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ensime/emacs-scala-mode</span>
slack <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yuya373/emacs-slack</span>
smartparens <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Fuco1/smartparens</span>
smex <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/nonsequitur/smex/</span>
solaire-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/hlissner/emacs-solaire-mode</span>
swift-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/swift-emacs/swift-mode</span>
sx <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/vermiculus/sx.el/</span>
tabbar <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/dholm/tabbar</span>
tide <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/ananthakumaran/tide</span>
toc-org <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/snosov1/toc-org</span>
treemacs <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/Alexander-Miller/treemacs</span>
undo-tree <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://www.dr-qubit.org/emacs.php</span>
vdiff <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/justbur/emacs-vdiff</span>
virtualenvwrapper  <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/porterjamesj/virtualenvwrapper.el</span>
visual-regexp <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/benma/visual-regexp.el</span>
visual-regexp-steroids <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/benma/visual-regexp-steroids.el</span>
wanderlust <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/wanderlust/wanderlust</span>
web-server <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/eschulte/emacs-web-server</span>
websocket <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/ahyatt/emacs-websocket</span>
which-key <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/justbur/emacs-which-key</span>
yaml-mode <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/yoshiki/yaml-mode</span>
yari <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/hron/yari.el</span>
yasnippet  <span style="color: #62686E;">;; </span><span style="color: #62686E;">http://github.com/joaotavora/yasnippet</span>
yasnippet-snippets <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/AndreaCrotti/yasnippet-snippets</span>
ztree) <span style="color: #62686E;">;; </span><span style="color: #62686E;">https://github.com/fourier/ztree</span>
<span style="color: #7e7e87;">"A list of packages to ensure are installed at launch."</span>)

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">ensure-packages-package-installed-p</span> (p)
  (<span style="color: #51afef;">cond</span> ((package-installed-p p) t)
        (t nil)))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">ensure-packages-installed-p</span> ()
  (mapcar 'ensure-packages-package-installed-p ensure-packages))

(<span style="color: #51afef;">defun</span> <span style="color: #5cEfFF;">ensure-packages-install-missing</span> ()
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">unless</span> (every 'identity (ensure-packages-installed-p))
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">check for new packages (package versions)</span>
  (message <span style="color: #7bc275;">"%s"</span> <span style="color: #7bc275;">"Emacs is now refreshing its package database..."</span>)
  (package-refresh-contents)
  (message <span style="color: #7bc275;">"%s"</span> <span style="color: #7bc275;">" done."</span>)
  <span style="color: #62686E;">;; </span><span style="color: #62686E;">install the missing packages</span>
  (<span style="color: #51afef;">dolist</span> (p ensure-packages)
    (<span style="color: #51afef;">when</span> (not (package-installed-p p))
      (package-install p)))))

(<span style="color: #51afef;">provide</span> '<span style="color: #a991f1;">ensure-packages</span>)

<span style="color: #62686E;">;; </span><span style="color: #62686E;">Uncomment this to install missing packages during init</span>

(ensure-packages-install-missing)

</pre>
</div>
</div>
</div>
</div>
